export default function(url,methd){
    const Mock=require('mockjs');
    Mock.mock(url,methd,{
          Tx:[
              {
                  img:"../../../../static/New/Nwe1.jpg",
                  Tx1:"蜕变，重生，终于等到你！",
                  Tx2:"在过去的四年里，魅族经历了困顿，迷茫，有些力不从心，一直没找到自己的状态，但是从今年开始，从15开始到16，创始人黄章的出山回归让魅族慢慢找回了曾经MX2,MX3时期的感觉，开始了复兴之路，这一刻，让魅友，让大多数期待他重新崛起的用户看到了希望，这一刻的到来，让太多的曾经的忠实用户憋的太久，也让鱼龙混杂，良莠不齐的市场迎来了一阵春风，市场上的一股清流，让人倍感清爽，舒畅..."  
              },
              {
                img:"../../../../static/New/Nwe2.jpg",
                Tx1:"小米MIX 2S 翡翠色开售，橙色跑兰州站来袭",
                Tx2:"①小米MIX 2S翡翠色 8+256GB 3999元开售陶瓷手机的色彩时代来了！小米携手敦煌研究院带来小米MIX 2S翡翠色 & 翡翠艺术版礼盒，8GB+256GB 3999元。全新陶瓷翡翠色的背后，是敦煌壁画色彩千年不变的秘密，也是科技与艺术的相互成就。②小爱同学月活跃设备已超过3000万截止7月底，小爱同学月活跃设备超3000万，半年增速达500％！①支持上百款小米和生态链设备；②为小..."  
            },
            {
                img:"../../../../static/New/Nwe3.jpg",
                Tx1:"Apple Kyoto 将于星期六在京都市四条通盛大开幕",
                Tx2:"Apple Kyoto 以多层中庭为中心，每天这里还会举行免费的 Today at Apple 课程，涵盖摄影、音乐和编程等多种主题。星期六，Apple 在日本文化科技中心京都市的首家零售店将正式开幕，店址位于四条通。自 17 世纪以来，四条通一直是京都市著名的购物街，周围遍布着许多久负盛名的神社。Apple Kyoto 的建筑灵感源于京都市当地的设计和材料，受日式灯笼的启发，上部空间采用半透明封..."  
            },
            {
                img:"../../../../static/New/Nwe4.jpg",
                Tx1:"性能怪兽，A11处理器到底有多强大？看完你就明白了",
                Tx2:"在今年的苹果发布会上，苹果照例推出了新款的手机，分别是 iPhone8、 iPhone8 Plus 和 iPhone X（十周年特别版）。虽然 iPhoneX 和其余两款手机有很多不同，也加入了很多新功能，但这些新功能都离不开强大的 A11 Bionic 处理器。A11 Bionic处理器全称叫做：A11仿生处理器,官方宣称这款全新推出的 A11 仿生芯片，它的四个能效核心速度比 A10 Fusi..."  
            },
            {
                img:"../../../../static/New/Nwe5.jpg",
                Tx1:"高能四核独显 小米笔记本Air 13.3升级评测",
                Tx2:"做手机只为交个朋友的小米董事长&CEO雷军，投资的“米系”科技产业公司不计其数。基本每款打上“小米”烙印的产品，都能快速地被广大年轻消费者所认可。发布于2016年7月27日的第一款小米笔记本Air 13，以出色的外观设计、均衡的配置和不到5000元的定价，成为当时主流轻薄本市场的一匹黑马。现在，搭载了Intel第八代四核心酷睿处理器的小米笔记本Air 13再度升级来袭，深空灰配色更具质感。..."  
            },
            {
                img:"../../../../static/New/Nwe6.jpg",
                Tx1:"锤子Smartisan OS 6.6.5新功能：无限屏太爽！",
                Tx2:"随着坚果Pro 2S的发布，锤子科技也公布了Smartisan OS 6.6.5更新，新增41项功能，优化25项细节。此次系统升级主要带来了三项主要内容：TNT、子弹短信以及无限屏。现场并没有演示TNT，不过罗永浩强调，实际上如果你不考虑触控版本，绝大多数显示器插上手机都可以体验TNT系统。接下来，坚果R1与坚果Pro 2S将开放TNT的系统众测。子弹短信是一款极速高效的聊天软件，语音与文字的完美..."  
            },
            {
                img:"../../../../static/New/Nwe7.jpg",
                Tx1:"为庆祝中国全民健身日，Apple 推出 Apple Watch 专属奖章",
                Tx2:"中国的 Apple Watch 用户在 8 月 8 日当天完成 30 分钟或更长的体能训练，即可获得全民健身日奖章。为了庆祝 8 月 8 日的全民健身日，Apple 鼓励中国的 Apple Watch 用户积极动起来，参与全新的健身记录挑战。用户在 8 月 8 日当天成功完成 3..."  
            },
            {
                img:"../../../../static/New/Nwe8.jpg",
                Tx1:"高通骁龙845性能实测：是否真能提升30%？",
                Tx2:"在2017年12月份的高通骁龙技术峰会上，高通正式发布了旗下的全新的旗舰级移动平台骁龙845，它堪称是目前地表上最强大的移动SoC，至少从纸面数字来看是这样的。规格方面，骁龙845采用三星10nm LPP工艺打造，升级到了Kryo 385内核，依然是八核心架构，四颗大核心最高频率可达2.8GHz，性能提升25%-30%；四颗小核心频率可达1.8GHz，性能提升15%。GPU部分，骁龙845升级到了..."  
            },
          ]
    })
}